{
  "regulation_id": "REG_EC9D8610F102",
  "regulation_title": "kkkk",
  "date_of_law": "2026-02-28",
  "date_processed": "2026-02-28",
  "total_risks_flagged": 5,
  "risks": [
    {
      "policy_id": "working_time_policy_morocco_en",
      "severity": "MEDIUM",
      "divergence_summary": "The internal policy excerpt is silent on all mandatory employer obligations outlined in the new regulation, including workplace safety protocols, health insurance provision, data protection, and audit requirements.",
      "conflicting_policy_excerpt": "- **Employees** must comply with their assigned working schedules, record their working time honestly and report any situation likely to exceed legal limits.",
      "new_rule_excerpt": "All companies must implement workplace safety protocols. Employers must provide health insurance to all employees. Employers must protect employee personal data.",
      "recommendation": "The legal team must conduct a comprehensive review of all company policies to ensure explicit coverage and implementation of all mandatory requirements from the new EMPLOYMENT REGULATIONS."
    },
    {
      "policy_id": "personal_data_protection_policy_morocco_en",
      "severity": "HIGH",
      "divergence_summary": "The internal policy excerpt addresses general compliance for personal data but fails to include the new regulation's mandatory requirement for encrypting all employee records.",
      "conflicting_policy_excerpt": "All employees and users who have access to personal data must comply with this policy and the related procedures.",
      "new_rule_excerpt": "Companies shall encrypt all employee records.",
      "recommendation": "Update the internal policy and its related procedures to explicitly mandate the encryption of all employee records to comply with Article 3 of the new regulation."
    },
    {
      "policy_id": "personal_data_protection_policy_morocco_en",
      "severity": "MEDIUM",
      "divergence_summary": "The internal policy does not explicitly mandate encryption for all employee records, which is a specific and mandatory technical requirement in the new regulation under data protection.",
      "conflicting_policy_excerpt": "The Company implements technical and organisational measures appropriate to the risks, including but not limited to:",
      "new_rule_excerpt": "Companies shall encrypt all employee records.",
      "recommendation": "Update Section 8 of the Data Security policy to explicitly state that all employee records must be encrypted, aligning with Article 3 of the new Employment Regulations."
    },
    {
      "policy_id": "information_systems_security_policy_morocco_en",
      "severity": "MEDIUM",
      "divergence_summary": "The internal policy mandates general data protection and confidentiality but does not explicitly require the encryption of all employee records, which is a mandatory control under the new regulation.",
      "conflicting_policy_excerpt": "Protect the confidentiality, integrity and availability of information; Comply with legal and contractual obligations (personal data protection...); Reduce the risk of data leaks, fraud, loss of information and service interruption.",
      "new_rule_excerpt": "Companies shall encrypt all employee records.",
      "recommendation": "Update the internal policy to explicitly mandate encryption for all employee records to comply with Article 3 of the new regulation."
    },
    {
      "policy_id": "working_time_policy_morocco_en",
      "severity": "MEDIUM",
      "divergence_summary": "The internal policy on recording working time fails to address the mandatory requirements for the protection and encryption of employee records as stipulated by Article 3 of the new regulation.",
      "conflicting_policy_excerpt": "3. **Recording of working time** - Managers must ensure that working time is recorded using the system chosen by the Company (badge, timesheet, digital tool, etc.).",
      "new_rule_excerpt": "Employers must protect employee personal data. Companies shall encrypt all employee records.",
      "recommendation": "Update Section 3 of the internal policy to explicitly include mandatory requirements for the protection and encryption of all recorded working time data, aligning with Article 3 of the new regulation."
    }
  ],
  "metadata": {
    "total_policies_analyzed": 5,
    "analysis_engine": "ARCA v1.0",
    "agents_used": [
      "PolicyResearcher",
      "ComplianceAuditor",
      "ReportGenerator"
    ]
  }
}